# 2.Даны две переменные x = 10 и y = 55. Поменяйте их значения местами. 
# Выведите значения переменных на экран до и после замены.

x = 10
y = 55

print(f' {x, y}, {y, x}')

